### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# Use display instead of print for nicer output formatting
from IPython.display import display as disp

# File to Load (Remember to Change These)
resource_path = "Resources/purchase_data.csv"

# Create a DataFrame from the purchase_data.csv file with the read_csv method 
sales_data = pd.read_csv(resource_path).dropna()


disp(sales_data.head().style.hide_index())

## Player Count

* Display the total number of players

In [2]:
# Create player_count variable for later use
player_count = sales_data["SN"].nunique()

# Create a data frame by passing a dictionary
player_total = pd.DataFrame({"Total Number of Players": [player_count]})

# Use the style.hide_index method for prettier formatting
disp(player_total.style.hide_index())

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [3]:
col = ["Number of Unique Items", 
       "Average Price", 
       "Number of Purchases", 
       "Total Revenue"]

val = [[sales_data["Item ID"].nunique()], 
       [sales_data["Price"].mean()], 
       [sales_data["SN"].count()], 
       [sales_data["Price"].sum()]]

summary_table = pd.DataFrame(dict(zip(col, val)))

forms = ['{:,}', '${:,.2f}', '{:,}', '${:,.2f}']

for i, var in enumerate(col):
    summary_table[var] = summary_table[var].map(forms[i].format)
    
    
disp(summary_table.style.hide_index())

### Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [4]:
genders = sales_data[["Gender", "SN"]].drop_duplicates().groupby("Gender").count()
genders["Player Percentages"] = (genders["SN"] / player_count).map('{:.2%}'.format)
gender_demographics = genders.round(4).rename(columns={"SN": "Player Counts"})


disp(gender_demographics)

                       Player Counts Player Percentages
Gender
Female                            81             14.06%
Male                             484             84.03%
Other / Non-Disclosed             11              1.91%


### Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [7]:
# Create grouby object to generate the column value lists
gender_agg = sales_data.groupby("Gender")

col = ["Purchase Count",
       "Average Purchase Price",
       "Total Purchase Value",
       "Avg Total Purchase per Person"]

val = [list(gender_agg["Purchase ID"].count()),
       list(gender_agg["Price"].mean()),
       list(gender_agg["Price"].sum()),
       list(gender_agg["Price"].sum() / gender_demographics["Player Counts"])]

gen_type = list(gender_demographics.index)

gender_purchases = pd.DataFrame(dict(zip(col, val)), index=gen_type).rename_axis("Gender")

forms = ['{:,}', '${:,.2f}', '${:,.2f}', '${:,.2f}']

for i, var in enumerate(col):
    gender_purchases[var] = gender_purchases[var].map(forms[i].format)

       
disp(gender_purchases)

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80